//
//  DataText.swift
//  Pass Data Tab Controller
//
//  Created by Viktor on 02/07/2019.
//  Copyright © 2019 viktorsoft. All rights reserved.
//

import UIKit

protocol UITabBarDataSorceDelegate {
    func getText(_ index: Int) -> String
}

class DataText: UIViewController, UITabBarDataSorceDelegate {
    
    func getText(_ index: Int) -> String {
        
        let textArray: [String] = [
            "Эта история о том, как 90-е чуть не убили во мне программиста. Еще со школы мне нравились точные науки и информатика. В начале 90-х я спаял и настроил свой первый компьютер ZX Spectrum, в народе 'синклер'. На нем я делал небольшие программки на basiс для расчета курсовиков. Я мог сутками писать разные программы, но нужно было зарабатывать. В те времена свободная торговля только зарождалась, и с чем бы ты ни вышел на рынок, все продавалось 'на ура'.",
            "Но торговля отнимала много времени, и хобби пришлось отложить до лучших времен. В 2003 г. для учета в бизнесе потребовалась 1С-ка. С каким интересом я смотрел за программистом, который дописывал всякие фишки, которые я же и придумывал! Однажды он даже не выдержал: Откуда столько идей? Мы плотно сотрудничали на протяжении нескольких лет, а я внимательно смотрел за всем процессом, и как губка все впитывал. Однажды я попробовал сам реализовать очередную доработку и… у меня получилось!",
            "После этого я стал сам сопровождать свою 1С-ку. Моими фишками с удовольствием пользовались сотрудники, но хотелось создавать для большего круга пользователей. Я начал изучать языки для вэба, такие как HTML, CSS, javascript и PHP. Затем загорелся мобильной разработкой и добрался до изучения Swift и iOS SDK."
        ]
        return textArray[index]
    }
}
